Repository: acastrodev/stride-docs-catproject
Catalog: stride-docs-level2.tmx
Source language: en
Languages: pt_br

source: These syntaxes are specific to Docfx and may not render correctly on other platforms, like GitHub.
pt_br: Essas sintaxes são específicas do Docfx e podem não ser renderizadas corretamente em outras plataformas, como o GitHub.

source: This action will deploy the website to the Azure Web App.
pt_br: Essa ação implantará o site no Aplicativo Web.

source: This approach helps maintainers visualize and assess your proposed changes more effectively.
pt_br: Essa abordagem ajuda os mantenedores a visualizar e avaliar suas alterações propostas de forma mais eficaz.

source: This can enhance understanding and demonstrate practical applications of API elements.
pt_br: Isso aumenta a compreensão e demonstrar aplicações práticas dos elementos da API.

source: This collaborative effort enhances the project's quality.
pt_br: Essa colaboração ajuda a melhorar a qualidade do projeto.

source: This creates a personal copy for you to work on.
pt_br: Isso criará uma cópia pessoal do repositório para você trabalhar.

source: This document serves as a running log of all significant changes slated for inclusion in the next release.
pt_br: Esse documento serve como um registro contínuo de todas as mudanças significativas previstas para a próxima versão.

source: This folder contains images and videos used in the manual pages.
pt_br: Essa pasta contém imagens e vídeos usados nas páginas do manual.

source: This folder contains images.
pt_br: Essa pasta contém imagens.

source: This guide assumes familiarity with the basics of Git and GitHub, focusing on providing instructions for creating pull requests (PRs) that are straightforward for the Stride team to review and merge.
pt_br: Este guia assume que você já tem familiaridade com os conceitos básicos de Git e GitHub, e tem como objetivo fornecer instruções para criar pull requests (PRs) que sejam fáceis para a equipe do Stride revisar e mesclar.

source: This guide is crafted for individuals who already have access to the Azure subscription.
pt_br: Este guia foi elaborado para pessoas que já possuem acesso a uma subscrição Azure.

source: This guide outlines the fundamental workflow for contributing to various Stride projects, including the Stride engine, Stride website, and Stride documentation.
pt_br: Este guia descreve o fluxo de trabalho fundamental para contribuir com diversos projetos do Stride, incluindo o motor Stride, o site do Stride e a documentação do Stride.

source: This guide serves primarily as a reference for maintainers in the event that a new deployment setup is required.
pt_br: Este guia serve principalmente como referência para mantenedores, caso seja necessário configurar uma nova implantação.

source: This includes the dark theme, enabled by Docfx.
pt_br: Isso inclui o tema escuro, habilitado pelo Docfx.

source: This information is invaluable for developers integrating these features into their projects.
pt_br: Essas informações são inestimáveis para os desenvolvedores que integram esses recursos em seus projetos.

source: This is crucial because the file name dictates the URL of the content page, which plays a significant role in search engine optimization (SEO).
pt_br: Isso é crucial porque o nome do arquivo determina a URL da página de conteúdo, o que desempenha um papel importante na otimização para motores de busca (SEO).

source: This is to keep the git history clean and to make it easier to understand the changes that were made in the future.
pt_br: Isso mantém o histórico do Git mais limpo e facilita o entendimento das mudanças no futuro.

source: This may include:
pt_br: Exemplos:

source: This means that only one label will be automatically applied to the release notes.
pt_br: Isso significa que apenas um rótulo será usada automaticamente nas notas de versão

source: This practice allows users to receive contextual information within their IDEs and aids in generating comprehensive API documentation.
pt_br: Essa prática permite que os usuários recebam informações contextuais diretamente nas IDEs e contribui para gerar uma documentação da API completa.

source: This process ensures that contributions are beneficial and fit the project's goals.
pt_br: Esse processo garante que as contribuições estejam alinhadas com os objetivos do projeto.

source: This property may need to be set to False or True depending on the specific requirements of your deployment.
pt_br: Essa propriedade pode precisar ser definida como False ou True dependendo das necessidades específicas da sua implantação.

source: This should resolve JS url related errors.
pt_br: Isso deve resolver erros de URL relacionados a arquivos JS.

source: This step integrates your contribution with the main codebase.
pt_br: Assim, sua contribuição será oficialmente integrada ao projeto.

source: This step is especially important as it demonstrates due diligence in testing your contribution, significantly aiding the review process by ensuring functionality and reducing potential integration issues.
pt_br: Esse último passo é essencial, pois demonstra cuidado ao validar a funcionalidade do que foi proposto, facilitando a revisão e evitando problemas futuros na integração.

source: This systematic approach helps streamline the review process, making it easier for the Stride team to understand, review, and merge your contributions efficiently.
pt_br: Esse formato sistematizado ajuda a equipe do Stride a entender, revisar e aceitar as contribuições com mais agilidade e clareza.

source: This teamwork between the contributors and our review team helps keep our documentation a rich and invaluable resource for everyone in our community.
pt_br: Essa parceria com a equipe de revisão ajuda a manter a documentação um recurso rico e valioso para toda a comunidade.

source: This workflow is applicable to contributions to the Stride engine, Stride website, and Stride documentation.
pt_br: Esse fluxo é aplicável às contribuições para o motor de jogos, o site e a documentação do Stride.

source: This workflow might also need to be added to the master branch if it is not already present.
pt_br: Esse workflow também pode precisar ser adicionado à branch master, caso ainda não esteja presente.

source: Title Prefixing
pt_br: Prefixos no título

source: To address this, you need to modify the GitHub Action:
pt_br: Para corrigir isso, você precisa alterar a GitHub Action:

source: To disable the push trigger, retain only workflow_dispatch (manual trigger) as shown below:
pt_br: Para desativar o acionador de push, mantenha apenas o workflow_dispatch (acionador manual), conforme abaixo:

source: To make the most out of this section, you should be familiar with scripting concepts and have some experience in programming.
pt_br: Para aproveitar ao máximo esta seção, você deve estar familiarizado com conceitos de programação de scripts e ter alguma experiência em programação.

source: To showcase your updates, especially helpful for design changes pending review, you can deploy the docs website either to your infrastructure or to GitHub Pages, a free hosting service.
pt_br: Para apresentar suas atualizações, especialmente úteis no caso de alterações de design pendentes de revisão, você pode implantar o site da documentação em sua própria infraestrutura ou no GitHub Pages, um serviço gratuito de hospedagem.

source: Tools and Importers
pt_br: Ferramentas e importadores

source: Tutorials
pt_br: Tutoriais

source: Tutorials and articles.
pt_br: Tutoriais e artigos.

source: Type Conversion
pt_br: Conversão de tipos

source: UI
pt_br: Interface do usuário

source: Under Instance Details, enter:
pt_br: Em Detalhes da instância, insira:

source: United Kingdom
pt_br: Reino Unido

source: Update toc.yml (or toc.md) file in the manual folder to include the new page or folder.
pt_br: Atualize o arquivo toc.yml (ou toc.md) dentro da pasta manual para incluir a nova página ou pasta.

source: Update toc.yml file in the tutorial folder to include the new tutorial folder.
pt_br: Atualize o arquivo toc.yml na pasta tutorial para incluir a nova pasta de tutorial.

source: Update Docfx version
pt_br: Atualização da versão do Docfx

source: Update the content of an existing page (manual, tutorial or release note, ..)
pt_br: Atualizar o conteúdo de uma página existente (manual, tutorial ou nota de versão, etc.)

source: Updating the Manual
pt_br: Atualizando o manual

source: Upon saving, the pages build and deployment action is triggered again, adding a CNAME file containing your custom domain name to the gh-pages branch
pt_br: Após salvar, a ação pages build and deployment será acionada novamente, adicionando um arquivo CNAME contendo seu domínio personalizado à branch gh-pages

source: Upon successful build, a gh-pages branch will be created
pt_br: Após a compilação bem-sucedida, uma branch gh-pages será criada

source: Use any existing page as a template for the new page.
pt_br: Use qualquer página existente como modelo para a nova página.

source: VVVV integration
pt_br: Integração com VVVV

source: Video Tutorials
pt_br: Tutoriais em vídeo

source: Visual Programming
pt_br: Programação visual

source: Visual programming, VVVV.
pt_br: Programação visual, VVVV.

source: Water
pt_br: Água

source: We can define small updates as changes to the content of the website:
pt_br: Consideramos pequenas atualizações aquelas que envolvem alterações no conteúdo do site, como:

source: We need to extract the app-name and publish-profile values from it and disable the push trigger.
pt_br: Precisamos extrair os valores de app-name e publish-profile dele e desabilitar o acionador de push.

source: We utilize the modern template provided by Docfx, which employs the Bootstrap framework, version 5.3.
pt_br: Utilizamos o template modern fornecido pelo Docfx, que emprega o framework Bootstrap na versão 5.3.

source: Web Assets
pt_br: Recursos web

source: Welcome to the Stride API documentation.
pt_br: Bem-vindo à documentação da API do Stride.

source: What is a small update?
pt_br: O que é considerado uma pequena atualização?

source: When merging a pull request, the Stride team might squash the commits into a single commit.
pt_br: Ao mesclar um pull request, a equipe do Stride pode fazer squash dos commits em um único commit.

source: When merging a pull request, the title should be prefixed based on the label:
pt_br: Ao mesclar um PR, o título deve conter um prefixo baseado nos rótulos (labels):

source: When submitting a pull request, especially for substantial changes, it's recommended to include screenshots or a link to your local deployment.
pt_br: Ao enviar um pull request, especialmente para mudanças grandes, recomenda-se incluir capturas de tela ou um link para a versão local do site.

source: When submitting a pull request, you'll use a template that guides you through providing all the necessary details for a smooth review process.
pt_br: Ao enviar um pull request, você utilizará um modelo que ajuda a fornecer todas as informações necessárias para uma revisão eficiente.

source: Whether you decide to contribute more or take a break, your efforts have now been integrated into the project.
pt_br: Seja para continuar contribuindo ou fazer uma pausa, suas mudanças já foram integradas ao projeto.

source: Whether you're a seasoned contributor or new to the project, this workflow ensures your contributions are effectively integrated.
pt_br: Seja você um colaborador experiente ou esteja começando agora, este fluxo garante que suas contribuições sejam integradas de forma eficaz.

source: XML Comments and Docs
pt_br: Comentários XML e documentação

source: Yaml Serializer Source Generator
pt_br: Gerador de código-fonte Yaml Serializer

source: You are always welcome to create an issue to discuss your changes before you start working on them.
pt_br: Você também pode criar uma issue para discutir suas alterações antes de começar a trabalhar nelas.

source: You can observe that existing folders might have a media folder.
pt_br: Observe que algumas pastas existentes possuem uma pasta media.

source: You can observe that existing tutorials have a media folder.
pt_br: Verifique que os tutoriais existentes possuem uma pasta media.

source: You can use any text editor to make changes.
pt_br: Você pode usar qualquer editor de texto para fazer modificações.

source: You can use this folder or create a new one in your folder.
pt_br: Você pode usar essa pasta ou criar uma nova dentro da sua própria pasta.

source: You have the option to stop the currently running action
pt_br: Você pode interromper a execução atual da action

source: You might see some JS errors, related to file expected in the root level.
pt_br: Você pode ver alguns erros de JS, relacionados a arquivos esperados no nível raiz.

source: You should be familiar with Bootstrap Utilities which help you to achieve most of the styling requirements.
pt_br: Você deve estar familiarizado com Utilities do Bootstrap, que ajudam a atender à maioria dos requisitos de estilo.

source: Your website should now be fully operational on your custom domain, for example, https://stride-docs.vaclavelias.com/4.2/en/ is hosted on GitHub Pages
pt_br: Seu site agora deve estar totalmente operacional em seu domínio personalizado, por exemplo: https://stride-docs.vaclavelias.com/4.2/en/, hospedado no GitHub Pages

source: Z[End] %% Edges
pt_br: Z[Fim] %% Edges

source: ⌨️ Input
pt_br: ⌨️ Entrada

source: ⚙️ Example projects
pt_br: ⚙ Exemplos de projetos

source: ⚙️ Physics
pt_br: ⚙️ Física

source: ⛰️ Terrain and Water
pt_br: ⛰️ Terreno e água

source: ⨺ Models and Animations
pt_br: ⨺ Modelos e animações

source: 🍎 Physics
pt_br: 🍎 Física

source: 🎉 New Features
pt_br: 🎉 Novas funcionalidades

source: 🎓 Tutorials and Articles
pt_br: 🎓 Tutoriais e artigos

source: 🎥 Rendering and camera
pt_br: 🎥 Renderização e câmera

source: 🐞 Bug Fixes
pt_br: 🐞 Correções de bugs

source: 👨‍💻 Programming and Scripting
pt_br: 👨‍💻 Programação e scripting

source: 👾 Games and demos
pt_br: 👾 Jogos e demos

source: 💥 Breaking Changes
pt_br: 💥 Quebras de compatibilidade

source: 🔌 Embedding and Integration
pt_br: 🔌 Incorporação e integração

source: 🔧 Engineering
pt_br: 🔧 Engenharia

source: 🗠 Visual programming
pt_br: 🗠 Programação visual

source: 🛠️ Tools and importers
pt_br: 🛠 Ferramentas e importadores

source: 🪟 UI
pt_br: 🪟 Interface de usuário
